na423-hw7-backward-step/sample/constant/polyMesh/blockMeshDict.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0 0 0)	    //0
    (35 0 0)	    //1
    (35 0.5 0)	    //2
    (0 0.5 0)	    //3
    (0 0 0.1)	    //4
    (35 0 0.1)	    //5
    (35 0.5 0.1)    //6
    (0 0.5 0.1)	    //7
    (65 0 0)	    //8
    (65 0.5 0)	    //9
    (65 0 0.1)	    //10
    (65 0.5 0.1)    //11

    (35 -0.5 0)	    //12
    (35 -0.5 0.1)   //13
    (65 -0.5 0)	    //14
    (65 -0.5 0.1)   //15
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (350 5 1) simpleGrading (1 1 1)
    hex (1 8 9 2 5 10 11 6) (300 5 1) simpleGrading (1 1 1) //This is the top block downstream of channel
    hex (12 14 8 1 13 15 10 5) (300 5 1) simpleGrading (1 1 1) //This is the bottom block downstream of channel
);

edges
(
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (3 7 6 2)
	    (2 6 11 9)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 9 11 10)
	    (10 15 14 8)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (1 5 4 0)
	    (12 14 15 13)
            (12 13 5 1)
        );
    }


    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
	    (5 10 11 6)
	    (1 2 9 8)
	    (12 1 8 14)
	    (13 15 10 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
