na423-hw7-backward-step/sample/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          600;
        startFace       8390;
    }
    inlet
    {
        type            patch;
        nFaces          5;
        startFace       8990;
    }
    outlet
    {
        type            patch;
        nFaces          10;
        startFace       8995;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          605;
        startFace       9005;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          9000;
        startFace       9610;
    }
)

// ************************************************************************* //
